In [2]:
import pandas as pd

In [8]:
staff_df=pd.DataFrame([{'Name':'Ram','Role':'Director of HR'},
                       {'Name':'lakshmi','Role':'Course liasion'},
                      {'Name':'James','Role':'Grader'}])
staff_df=staff_df.set_index('Name')
student_df=pd.DataFrame([{'Name':'James','School':'Business'},
                        {'Name':'Mike','School':'Law'},
                        {'Name':'lakshmi','School':'Engineering'}])
student_df=student_df.set_index('Name')
staff_df.head()

                   Role
Name
Ram      Director of HR
lakshmi  Course liasion
James            Grader

In [9]:
student_df.head()

              School
Name
James       Business
Mike             Law
lakshmi  Engineering

In [10]:
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

                   Role       School
Name
James            Grader     Business
Mike                NaN          Law
Ram      Director of HR          NaN
lakshmi  Course liasion  Engineering

In [11]:
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

                   Role       School
Name
lakshmi  Course liasion  Engineering
James            Grader     Business

In [12]:
pd.merge(staff_df,student_df,how='left',left_index=True,right_index=True)

                   Role       School
Name
Ram      Director of HR          NaN
lakshmi  Course liasion  Engineering
James            Grader     Business

In [13]:
pd.merge(staff_df,student_df,how='right',left_index=True,right_index=True)

                   Role       School
Name
James            Grader     Business
Mike                NaN          Law
lakshmi  Course liasion  Engineering

In [14]:
staff_df=staff_df.reset_index()
student_df=student_df.reset_index()
pd.merge(staff_df,student_df,how='left',left_on='Name',right_on='Name')

      Name            Role       School
0      Ram  Director of HR          NaN
1  lakshmi  Course liasion  Engineering
2    James          Grader     Business

In [17]:
staff_df=pd.DataFrame([{'Name':'Ram','Role':'Director of HR','Address':'Tanuku'},
                       {'Name':'lakshmi','Role':'Course liasion','Address':'Narsapur'},
                      {'Name':'James','Role':'Grader','Address':'Vijayawada'}])
staff_df=staff_df.set_index('Name')
student_df=pd.DataFrame([{'Name':'James','School':'Business','Address':'Guntur'},
                        {'Name':'Mike','School':'Law','Address':'Tanuku'},
                        {'Name':'lakshmi','School':'Engineering','Address':'Narsapur'}])
student_df=student_df.set_index('Name')
staff_df.head()

            Address            Role
Name
Ram          Tanuku  Director of HR
lakshmi    Narsapur  Course liasion
James    Vijayawada          Grader

In [18]:
student_df

          Address       School
Name
James      Guntur     Business
Mike       Tanuku          Law
lakshmi  Narsapur  Engineering

In [19]:
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

          Address_x            Role Address_y       School
Name
James    Vijayawada          Grader    Guntur     Business
Mike            NaN             NaN    Tanuku          Law
Ram          Tanuku  Director of HR       NaN          NaN
lakshmi    Narsapur  Course liasion  Narsapur  Engineering